# RunNotEnoughBoundaryCurves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..RunNotEnoughBoundaryCurves Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sketch run require boundaries (chains of one or more Boundary Lines)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RunNotEnoughBoundaryCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RunNotEnoughBoundaryCurves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RunNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace